# TP2 - DB Normalization and Querying

The objectives of this TP are:
1. Apply normalization 1NF -> 2NF -> 3NF
2. Perform SQL queries on the normalized database

In this TP, we will use a database **`wine.db`** (available in the course's website) containing wine information related to 'production' and 'sales'. 

> Production <---> Wine <---> Sales


---

### Working with db files in Jupyter
- Python provides an interface for SQLite through the *sqlite3* module
- The **`%%sql`** magic builds upon it (and other tools) to enable the usage of SQL commands within a Jupyter Notebook as in common SQL clients.
- Before proceeding, make sure that **`wine.db`** is in the same path as this notebook.
  - If **`wine.db`** is not in the same path, an empty **`wine.db`** file will be created, resulting in errors in later steps of the TP.
- The SQLite module in Python commits transactions automatically, this means that any change in the DB is immediately written to the file, e.g. creating/deleting tables.
  -  For this reason, it is recommended to have a backup of **`wine.db`** as it is provided in the course's website.

---

**`wine.db`** contains the following unnormalized tables:

<center>**Master1**</center>

|*Attribute*|         *Description*          |
| -------   |--------------------------------|
| NV        | Wine number                    |
| CRU       | Vineyard or group of vineyards |
| DEGRE     | Alcohol content                |
| MILL      | Vintage year                   |
| QTE       | Number of bottles harvested    |
| NP        | Producer number                |
| NOM       | Producer's last name           |
| PRENOM    | Producer's first name          |
| REGION    | Production region              |

From wikipedia:

__Cru__: Often used to indicate a specifically named and legally defined vineyard or ensemble of vineyards and the vines "which grow on [such] a reputed terroir; by extension of good quality." The term is also used to refer to the wine produced from such vines.


<center>**Master2**</center>

|*Attribute*|                         *Description*                  |
| -------   |--------------------------------------------------------|
| NV        | Wine number                                            |
| CRU       | Vineyard or group of vineyards                         |
| DEGRE     | Alcohol content                                        |
| MILL      | Vintage year                                           |
| DATES     | Buying date                                            |
| LIEU      | Place where the wine was sold                          |
| QTE       | Number of bottles bought                               |
| NB        | Client (buveur) number                                 |
| NOM       | Client's last name                                     |
| PRENOM    | Client's first name                                    |
| TYPE      | Type of client by volume of purchases                  |
| REGION    | Administrative Region (different to production region) |

In [1]:
import sqlite3    # Python interface for SQLite databases

In [2]:
def printSchema(connection):
    # Function to print the DB schema
    # Source: http://stackoverflow.com/a/35092773/4765776
    for (tableName,) in connection.execute(
        """
        select NAME from SQLITE_MASTER where TYPE='table' order by NAME;
        """
    ):
        print("{}:".format(tableName))
        for (
            columnID, columnName, columnType,
            columnNotNull, columnDefault, columnPK,
        ) in connection.execute("pragma table_info('{}');".format(tableName)):
            print("  {id}: {name}({type}){null}{default}{pk}".format(
                id=columnID,
                name=columnName,
                type=columnType,
                null=" not null" if columnNotNull else "",
                default=" [{}]".format(columnDefault) if columnDefault else "",
                pk=" *{}".format(columnPK) if columnPK else "",
            ))

In [3]:
conn = sqlite3.connect('wine.db')
c = conn.cursor()
print("Database schema:")
printSchema(conn)           # An usefull way to viualize the content of the database

Database schema:
MASTER1:
  0: NV(NUM)
  1: CRU(TEXT)
  2: DEGRE(NUM)
  3: MILL(NUM)
  4: QTE(NUM)
  5: NP(NUM)
  6: NOM(TEXT)
  7: PRENOM(TEXT)
  8: REGION(TEXT)
MASTER2:
  0: NV(NUM)
  1: CRU(TEXT)
  2: DEGRE(NUM)
  3: MILL(NUM)
  4: DATES(DATE)
  5: LIEU(TEXT)
  6: QTE(NUM)
  7: NB(NUM)
  8: NOM(TEXT)
  9: PRENOM(TEXT)
  10: TYPE(TEXT)
  11: REGION(TEXT)

From this point we will use __%%sql__ magic

In [4]:
%load_ext sql
%sql sqlite:///wine.db

# PART I: Database normalization

The first task on this TP is the normalization of the wine data. In its current state both tables **Master1** and **Master2** are in the First Normal Form (1NF).

By inspecting the content of these tables we can see that multiple tuples have NULL values.

In [5]:
%%sql SELECT *
FROM Master1
LIMIT 10;

 * sqlite:///wine.db
Done.

[(None, None, None, None, None, 3, 'Six', 'Paul', 'Alsace'),
 (None, None, None, None, None, 6, 'Marmagne', 'Bernard', 'Bourgogne'),
 (None, None, None, None, None, 8, "Lioger d'Harduy", 'Gabriel', 'Bourgogne'),
 (None, None, None, None, None, 16, 'Barbin', 'Bernard', 'Bourgogne'),
 (None, None, None, None, None, 17, 'Faiveley', 'Guy', 'Bourgogne'),
 (None, None, None, None, None, 18, 'Tramier', 'Jean', 'Bourgogne'),
 (None, None, None, None, None, 19, 'Dupaquier', 'Roger', 'Bourgogne'),
 (None, None, None, None, None, 20, 'Lamy', 'Jean', 'Bourgogne'),
 (None, None, None, None, None, 21, 'Cornu', 'Edmond', 'Bourgogne'),
 (None, None, None, None, None, 26, 'Violot', 'Gilbert', 'Bourgogne')]

* Notice that Jupyter *displays* 'None' instead of 'NULL'. 
  - This is only to comply with python notation.
* To account for NULL values, your SQL queries must test explicitly for 'NULL'.

Another problem in **Master1** and **Master2** is data redundancy, for example:

In [6]:
%%sql SELECT *
FROM Master1
WHERE NV = 45;

 * sqlite:///wine.db
Done.

[(45, 'Chiroubles', None, 1983, 90, 2, 'Boxler', 'Albert', 'Alsace'),
 (45, 'Chiroubles', None, 1983, 912, 67, 'Descombes', 'Jean Ernest', 'Beaujolais'),
 (45, 'Chiroubles', None, 1983, 98, 71, 'Chalandard', 'Danile', 'Jura'),
 (45, 'Chiroubles', None, 1983, 540, 78, 'Michlel', 'Pierre Emile', 'Jura'),
 (45, 'Chiroubles', None, 1983, 450, 86, 'Dumazet', 'Marc', 'Rhone')]

---

Additional resource for Normalization:

https://www.youtube.com/watch?v=UrYLYV7WSHM

---

#### Exercise 1.1

Convert table **Master1** to the Second Normal Form (2NF) or Third Normal Form (3NF) as applicable.
* Explain your answer
* List main functional dependencies (not all of them)
* Describe the schema of new tables and how they relate
  * You can write Tables as above or you can insert images in the notebook.
  
Remember that **`wine.db`** contains information related to wine 'production' and 'sells'.

> Production <---> Wine <---> Sales

A good start point is to look for the 'Wine' attributes.

**Hint:** Look for redundant information between the master tables.

Functional dependencies:
{NV, NP} -> Cru, Degre, mill, qte, Nom, Prenom, Region //it is not touple, just enumumeration
NV -> {Cru, Degre, mill}
NB -> {Nom, Prenom, Region} //assume, that there is no full namesakes in the same region
2NF for Master1 will be as follows:
Wine: {NV, CRU, DEGRE, MILL}
Productor: {NP, NOM, PRENOM, REGION}
Product: {NP, NV, QTE}
In table Master1 couple {NV, NP} is unique, so it is a key. Touples {Cru, Degre, mill} and {Nom, Prenom, Region} depends only on atributes NV and NP respectively, so we should move them into new tables. And after that we can create another table for sales.

#### Exercise 1.2

Convert table **Master2** to the Second Normal Form (2NF) or Third Normal Form (3NF) as applicable.
* Explain your answer
* List main functional dependencies (not all of them)
* Describe the schema of new tables and how they relate
  * You can write Tables as above or you can insert images in the notebook.

**Note:** For this part, consider that a wine can be bought in multiple locations and multiple times per day.

NB -> {Nom, Prenom, type}
Nv -> {Cru, Degre, Mill}
{Nb, Nv, Date, lieu} -> {Qte}
Lieu -> Region 
So we have to create 3 tables:
Buyer: {NB, NOM, PRENOM, TYPE}
BuyedWine: {NV, CRU, DEGRE, MILL}
Sale: {NB, NV, DATES, LIEU, QTE}
Region: {Lieu, Region}
//In such decomposition I`ve assumed, that region in tabel Master2 is the region, where wine was sold

Once you have defined the 2NF or 3NF (as applicable) we need to split the data into new tables.

A table can be created from the result of a query.

In the following example we will create a new table "dummy" to store the different values of alcohol content.

In [7]:
%%sql DROP TABLE IF EXISTS dummy;

-- Create dummy table
CREATE TABLE dummy AS
SELECT DISTINCT DEGRE
FROM MASTER1;

 * sqlite:///wine.db
Done.
Done.

[]

In [8]:
print("\nContent of the database")
printSchema(conn)

Content of the database
MASTER1:
  0: NV(NUM)
  1: CRU(TEXT)
  2: DEGRE(NUM)
  3: MILL(NUM)
  4: QTE(NUM)
  5: NP(NUM)
  6: NOM(TEXT)
  7: PRENOM(TEXT)
  8: REGION(TEXT)
MASTER2:
  0: NV(NUM)
  1: CRU(TEXT)
  2: DEGRE(NUM)
  3: MILL(NUM)
  4: DATES(DATE)
  5: LIEU(TEXT)
  6: QTE(NUM)
  7: NB(NUM)
  8: NOM(TEXT)
  9: PRENOM(TEXT)
  10: TYPE(TEXT)
  11: REGION(TEXT)
dummy:
  0: DEGRE(NUM)

In [9]:
%%sql
SELECT *
FROM dummy;

 * sqlite:///wine.db
Done.

[(None,),
 (11.5,),
 (11.3,),
 (12.1,),
 (10.9,),
 (11.7,),
 (11.2,),
 (12.3,),
 (11.9,),
 (11.8,),
 (10.7,),
 (11.4,),
 (10.5,),
 (11,),
 (11.6,),
 (12,),
 (10,),
 (12.5,),
 (10.8,),
 (14,),
 (11.1,),
 (13,)]

Looking into "dummy", we notice that our query includes NULL. This is not allowed if we were to use DEGRE as key for a table.

To correct this, we need to change the query to explicitly test for NULL as follows:

In [10]:
%%sql DROP TABLE IF EXISTS dummy;

-- Create dummy table
CREATE TABLE dummy AS
SELECT DISTINCT DEGRE
FROM MASTER1
WHERE DEGRE IS NOT NULL;

SELECT *
FROM dummy;

 * sqlite:///wine.db
Done.
Done.
Done.

[(11.5,),
 (11.3,),
 (12.1,),
 (10.9,),
 (11.7,),
 (11.2,),
 (12.3,),
 (11.9,),
 (11.8,),
 (10.7,),
 (11.4,),
 (10.5,),
 (11,),
 (11.6,),
 (12,),
 (10,),
 (12.5,),
 (10.8,),
 (14,),
 (11.1,),
 (13,)]

Notice that we use `NULL` given that `None` is only used for display.

In [11]:
# Remove "dummy" table
%sql DROP TABLE IF EXISTS dummy;

 * sqlite:///wine.db
Done.

[]

#### Exercise 1.3

Create the new tables from Master1:

In [12]:
%%sql drop view if exists Wine;
    CREATE VIEW Wine AS
    SELECT NV, CRU, DEGRE, MILL
    FROM Master1
    where nv is not null;
    
    drop view if exists Producer;
    create view Producer as
    select NP, NOM, PRENOM, REGION
    from Master1
    where np is not null;
    
    drop view if exists Product;
    create view Product as
    select NP, NV, QTE
    from Master1
    where np is not null or nv is not null;

 * sqlite:///wine.db
Done.
Done.
Done.
Done.
Done.
Done.

[]

#### Exercise 1.4

Create the new tables from Master2:

In [13]:
%%sql drop view if exists Buyer;
    CREATE VIEW Buyer AS
    SELECT NB, NOM, PRENOM, TYPE
    FROM Master2
    where nb is not null;
    
    drop view if exists BuyedWine;
    create view BuyedWine as
    select NV, CRU, DEGRE, MILL
    from Master2
    where nv is not null;
    
    drop view if exists Sale;
    create view Sale as
    select NB, NV, DATES, LIEU, QTE
    from Master2
    where nb is not null or nv is not null or dates is not null or lieu is not null;
    
    drop view if exists Region;
    create view Region as
    select lieu, region
    from Master2
    where lieu is not null;

 * sqlite:///wine.db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

# PART II: SQL QUERIES

In the second part of this TP you will create SQL queries to retrieve information from the database.

**Important:**

- You MUST use the normalized tables created in previous steps.
  - The normalized tables will also be used in TP3.
- Do NOT use **Master1** and **Master2** in your queries.

#### Exercise 2.1

What are the different types of clients (buveurs) by volume of purchases?

In [14]:
%%sql
select distinct TYPE
from buyer

 * sqlite:///wine.db
Done.

[('petit',), ('moyen',), ('gros',)]

#### Exercise 2.2

What regions produce Pommard or Brouilly?

In [15]:
%%sql
select distinct region
from Producer pd, Wine w, Product pt
where pd.NP = pt.NP
    and w.NV = pt.NV
    and w.cru = "Pommard" or w.cru = "Brouilly"

 * sqlite:///wine.db
Done.

[('Alsace',),
 ('Bourgogne',),
 ('Beaujolais',),
 ('Jura',),
 ('Rhone',),
 ('Provence',),
 ('Corse',),
 ('Languedoc',),
 ('Pyrenees',),
 ('Sud',),
 ('Savoie',)]

#### Exercise 2.3

What regions produce Pommard and Brouilly?

In [16]:
%%sql
select distinct region
from Producer pd, Wine w, Product pt
where pd.NP = pt.NP
    and w.NV = pt.NV
    and w.cru = "Pommard"

intersect

select distinct region
from Producer pd, Wine w, Product pt
where pd.NP = pt.NP
    and w.NV = pt.NV
    and w.cru = "Brouilly"

 * sqlite:///wine.db
Done.

[('Bourgogne',)]

#### Exercise 2.4

Get the number of wines bught by CRU and Mill√©sime

In [17]:
%%sql
select cru, mill, sum(qte) as Num
from Wine w, Product p
where w.NV = p.Nv
group by w.cru

 * sqlite:///wine.db
Done.

[('Arbois', 1980, 6594),
 ('Auxey Duresses', 1914, 2500),
 ('Beaujolais Primeur', 1983, 80),
 ('Beaujolais Villages', 1979, 9790),
 ('Bellet', 1976, 45),
 ('Blanquette de Limoux', 1978, 110),
 ('Bourgogne Passe Tout Grains', 1979, 350),
 ('Brouilly', 1975, 500),
 ('Cassis', 1978, 58),
 ('Chambolle Musigny', 1968, 120),
 ('Chapelle Chambertin', 1973, 40),
 ('Chateau Chalon', 1978, 2180),
 ('Chateau Corton Grancey', 1980, 70),
 ('Chenas', 1984, 136),
 ('Chiroubles', 1983, 11285),
 ('Chorey les Beaunes', 1955, 50),
 ('Clairette de Die', 1976, 25),
 ('Clos du roi', 1972, 986),
 ('Corbieres', 1978, 13830),
 ('Cornas', 1980, 1824),
 ('Corton', 1972, 50),
 ('Cote Rotie', 1994, 598),
 ('Cote de Brouilly', 1973, 460),
 ('Coteaux de Pierevert', 1967, 900),
 ('Coteaux du Tricastin', 1978, 3836),
 ('Cotes de Beaune Villages', 1975, 871),
 ('Cotes de Nuits', 1978, 150),
 ('Cotes de Provence', 1980, 21424),
 ('Cotes du Rhone', 1968, 13),
 ('Cotes du Rousillon', 1978, 2260),
 ('Crozes - Hermitage', 1972, 160),
 ('Crozes Hermitage', 1974, 1010),
 ('Crozes-Hermitage', 1983, 720),
 ('Etoile', 1979, 17650),
 ('Fleurie', 1980, 7149),
 ('Gentil', 1975, 1623),
 ('Gewurztraminer', 1968, 5325),
 ('Gigondas', 1978, 900),
 ('Grands Echezeaux', 1968, 60),
 ('Hermitage', 1979, 120),
 ('Julienas', 1974, 100),
 ('Mercurey', 1980, 937),
 ('Meursault', 1980, 150),
 ('Montagny', 1978, None),
 ('Monthelie', 1968, 320),
 ('Morgon', 1984, 150),
 ('Moulin a vent', 1983, 40),
 ('Palette', 1981, 2012),
 ('Pommard', 1976, 61),
 ('Pouilly Vinzelles', 1968, 2780),
 ('Puligny Montrachet', 1974, 60),
 ('Rasteau', 1980, 146),
 ('Richebourg', 1943, 90),
 ('Riesling', 1962, None),
 ('Rochgrande', 1968, 1140),
 ('Saint Amour', 1974, 1213),
 ('Saint Chinian', 1976, 471),
 ('Saint Veran', 1973, 213),
 ('Sancerre', 1998, 7000),
 ('Santenay', 1972, 70),
 ('Savigny les Beaunes', 1978, 1485),
 ('Seyssel', 1980, 3116),
 ('Sylvaner', 1982, 320),
 ('Tavel', 1968, 670),
 ("Tokay d'Alsace", 1982, 3318),
 ('Volnay', 1980, 10)]

#### Exercise 2.5

Retrieve the wine number (NV) of wines produced by more than three producers

In [18]:
%%sql
select Wine.NV, count(Producer.NP) as num
from Wine, Producer, Product
where Wine.nv = Product.nv
    and Producer.np = Product.np
group by Wine.nv
having count(Producer.np) > 3

 * sqlite:///wine.db
Done.

[(1, 8),
 (2, 5),
 (8, 4),
 (11, 5),
 (12, 21),
 (14, 4),
 (16, 6),
 (17, 6),
 (18, 4),
 (20, 5),
 (21, 5),
 (22, 4),
 (23, 4),
 (25, 6),
 (28, 5),
 (29, 5),
 (31, 5),
 (32, 14),
 (35, 8),
 (36, 4),
 (38, 4),
 (39, 4),
 (43, 33),
 (44, 4),
 (45, 55),
 (47, 4),
 (48, 4),
 (49, 4),
 (50, 4),
 (52, 4),
 (53, 4),
 (54, 36),
 (57, 4),
 (60, 16),
 (61, 4),
 (64, 18),
 (65, 10),
 (67, 30),
 (69, 18),
 (70, 6),
 (71, 6),
 (72, 4),
 (73, 6),
 (74, 27),
 (75, 6),
 (76, 10),
 (77, 4),
 (78, 50),
 (79, 15),
 (80, 4),
 (81, 4),
 (82, 12),
 (83, 6),
 (84, 6),
 (86, 4),
 (87, 42),
 (89, 45),
 (90, 14),
 (94, 8),
 (95, 6),
 (98, 35),
 (99, 14)]

#### Exercise 2.6

Which producers have not produced any wine?

In [19]:
%%sql
select Producer.np
from Producer, Product
where Producer.np = Product.np
group by Product.np
having count(Product.nv) = 0

 * sqlite:///wine.db
Done.

[(3,),
 (6,),
 (8,),
 (16,),
 (17,),
 (18,),
 (19,),
 (20,),
 (21,),
 (26,),
 (28,),
 (29,),
 (31,),
 (32,),
 (33,),
 (34,),
 (37,),
 (39,),
 (41,),
 (44,),
 (47,),
 (48,),
 (49,),
 (51,),
 (53,),
 (57,),
 (58,),
 (61,),
 (62,),
 (66,),
 (77,),
 (83,),
 (91,),
 (92,),
 (94,),
 (96,),
 (97,),
 (100,),
 (101,),
 (102,),
 (103,),
 (104,),
 (105,),
 (106,),
 (108,),
 (109,),
 (110,),
 (111,),
 (112,),
 (113,),
 (114,),
 (115,),
 (116,),
 (117,),
 (118,),
 (119,),
 (121,),
 (122,),
 (123,),
 (124,),
 (125,),
 (126,),
 (127,),
 (129,)]

#### Exercise 2.7

What clients (buveurs) have bought at least one wine from 1980?

In [20]:
%%sql
select distinct Buyer.nb, Buyer.nom, Buyer.prenom
from Buyer, BuyedWine, Sale
where Buyer.nb = Sale.nb
    and BuyedWine.nv = Sale.nv
    and BuyedWine.mill = '1980'

 * sqlite:///wine.db
Done.

[(2, 'Artaud', 'Antonin'),
 (45, 'Giono', 'Jean'),
 (44, 'Gide', 'Andre'),
 (50, 'Lautreamont', None),
 (8, 'Aragon', 'Louis'),
 (61, 'Mallarme', 'Stephane')]

#### Exercise 2.8

What clients (buveurs) have NOT bought any wine from 1980?

In [21]:
%%sql
select distinct Buyer.nb, Buyer.nom, Buyer.prenom
from Buyer, BuyedWine, Sale
except
select distinct Buyer.nb, Buyer.nom, Buyer.prenom
from Buyer, BuyedWine, Sale
where Buyer.nb = Sale.nb
    and BuyedWine.nv = Sale.nv
    and BuyedWine.mill = '1980'

 * sqlite:///wine.db
Done.

[(1, 'Aristote', None),
 (3, 'Aron', 'Raymond'),
 (4, 'Apollinaire', 'Guillaume'),
 (5, 'Audiberti', 'Jacques'),
 (6, 'Arrabal', 'Fernando'),
 (7, 'Anouilh', 'Jean'),
 (9, 'Ajar', 'Emile'),
 (10, 'Andersen', 'Yann'),
 (11, 'Breton', 'Andre'),
 (12, 'Bataille', 'Georges'),
 (13, 'Barthes', 'Roland'),
 (14, 'Bory', 'Jean Louis'),
 (15, 'Baudelaire', 'Charles'),
 (16, 'Balzac', 'Honore de'),
 (17, 'Camus', 'Albert'),
 (18, 'Celine', 'Louis Ferdinand'),
 (19, 'Ciceron', None),
 (20, 'Chateaubriand', 'Francois-Rene de'),
 (21, 'Corbiere', 'Tristan'),
 (22, 'Cocteau', 'Jean'),
 (23, 'Corneille', 'Pierre'),
 (24, 'Courrier', 'Paul Louis'),
 (25, 'Char', 'Rene'),
 (26, 'Diderot', 'Denis'),
 (27, 'Dumas', 'Alexandre'),
 (28, 'Dostoievsky', 'Fiodor'),
 (29, 'Fournier', 'Alain'),
 (30, 'La Fontaine', 'Jean de'),
 (31, 'Dante', None),
 (32, 'Eluard', 'Paul'),
 (33, 'Flaubert', 'Gustave'),
 (34, 'Mauriac', 'Francois'),
 (35, 'Fromentin', 'Eugene'),
 (36, 'Maurois', 'Andre'),
 (37, 'Freud', 'Sigmund'),
 (38, 'Montaigne', 'Michel de'),
 (39, 'Montesquieu', None),
 (40, 'Moliere', None),
 (41, 'Gauthier', 'Theophile'),
 (42, 'Goethe', 'Johann Wolfgang von'),
 (43, 'Musset', 'Alfred de'),
 (46, 'Hugo', 'Victor'),
 (47, 'Gary', 'Romain'),
 (48, 'Hardy', 'Thomas'),
 (49, 'Kafka', 'Franz'),
 (51, 'Lafargue', 'Paul'),
 (52, 'Carroll', 'Lewis'),
 (53, 'Lamartine', 'Alphonse de'),
 (54, 'Aurele', 'Marc'),
 (55, 'Michelet', 'Jules'),
 (56, 'Nerval', 'Gerard de'),
 (57, 'Marx', 'Karl'),
 (58, 'Marivaux', 'Pierre Carlet de Chamblain de'),
 (59, 'Nietzsche', 'Friedrich'),
 (60, 'Ovide', None),
 (62, 'Proust', 'Marcel'),
 (63, 'Maupassant', 'Guy de'),
 (64, 'Platon', None),
 (65, 'Pascal', 'Blaise'),
 (66, 'Perec', 'Georges'),
 (67, 'Nin', 'Anais'),
 (68, 'Prevert', 'Jacques'),
 (69, 'Queneau', 'Raymond'),
 (70, 'Paulhan', 'Jean'),
 (71, 'Radiguet', 'Raymond'),
 (72, 'Rabelais', 'Francois'),
 (73, 'Poe', 'Allan Edgard'),
 (74, 'Rimbaud', 'Arthur'),
 (75, 'Ronsard', 'Pierre'),
 (76, 'Racine', 'Jean'),
 (77, 'Rousseau', 'Jean-Jacques'),
 (78, 'Sandier', 'Jules'),
 (79, 'Sade', 'Donatien Alphonse Fran¬ø¬øs de'),
 (80, 'Sand', 'Georges'),
 (81, 'Sartre', 'Jean-Paul'),
 (82, 'Roussel', 'Rene'),
 (83, 'Sophocle', None),
 (84, 'Sue', 'Eugene'),
 (85, 'Segalen', 'Victor'),
 (86, 'Saint Exupery', 'Antoine de'),
 (87, 'Segur', 'Comtesse de'),
 (88, 'Shakespeare', 'William'),
 (89, 'Stendhal', None),
 (90, 'Vian', 'Boris'),
 (91, 'Verlaine', 'Paul'),
 (92, 'Verne', 'Jules'),
 (93, 'Virgile', None),
 (94, 'Zola', 'Emile'),
 (95, 'Zorn', 'Fritz'),
 (96, 'Wilde', 'Oscar'),
 (97, 'Vigny', 'Alfred de'),
 (98, 'Maturin', 'Robert'),
 (99, 'Cesar', 'Jules'),
 (100, 'Woolf', 'Virginia')]

#### Exercise 2.9

What clients (buveurs) have bought ONLY wines from 1980?

In [22]:
%%sql
select distinct Buyer.nb, Buyer.nom, Buyer.prenom
from Buyer, BuyedWine, Sale
where Buyer.nb = Sale.nb
    and BuyedWine.nv = Sale.nv
    and BuyedWine.mill = '1980'
except
select distinct Buyer.nb, Buyer.nom, Buyer.prenom
from Buyer, BuyedWine, Sale
where Buyer.nb = Sale.nb
    and BuyedWine.nv = Sale.nv
    and BuyedWine.mill != '1980'

 * sqlite:///wine.db
Done.

[(44, 'Gide', 'Andre'), (45, 'Giono', 'Jean'), (50, 'Lautreamont', None)]

#### Exercise 2.10

List all wines from 1980

In [23]:
%%sql
select distinct nv, cru, mill, degre
from Wine
where mill = '1980'

 * sqlite:///wine.db
Done.

[(1, 'Mercurey', 1980, 11.5),
 (4, 'Mercurey', 1980, 10.9),
 (16, 'Meursault', 1980, 12.1),
 (20, 'Cote de Brouilly', 1980, 12.1),
 (26, 'Chateau Corton Grancey', 1980, None),
 (28, 'Volnay', 1980, 11),
 (43, 'Fleurie', 1980, 11.4),
 (74, 'Arbois', 1980, 12),
 (78, 'Etoile', 1980, 12),
 (79, 'Seyssel', 1980, 11),
 (80, 'Seyssel', 1980, 11),
 (81, 'Cornas', 1980, 11.1),
 (82, 'Cornas', 1980, 11),
 (83, 'Saint Amour', 1980, 10),
 (84, 'Rasteau', 1980, 10),
 (85, 'Tavel', 1980, 11),
 (86, 'Tavel', 1980, 11),
 (87, 'Cotes de Provence', 1980, None)]

#### Exercise 2.11

What are the wines from 1980 bought by NB=2?

In [24]:
%%sql
select distinct BuyedWine.nv, BuyedWine.cru, BuyedWine.mill,BuyedWine.degre
from BuyedWine,Sale
where Sale.nb =2 AND BuyedWine.mill ='1980' and Sale.nv = BuyedWine.nv

 * sqlite:///wine.db
Done.

[(1, 'Mercurey', 1980, 11.5)]

#### Exercise 2.12

What clients (buveurs) have bought ALL the wines from 1980?

In [28]:
%%sql
select Buyer.nb, Buyer.nom, Buyer.prenom
from Buyer
where nb in(
    select temp.nb
    from Sale temp
    where temp.nv in(
        select temp.nv
        from Wine
        where mill = '1980'
    )
    group by temp.nb
    having count(temp.nb) = (
        select count(BuyedWine.nv)
        from BuyedWine
        where mill = '1980' 
    )  
)

 * sqlite:///wine.db
Done.

[]